* AWK

** Select on columns

Show top 5 processes created by me with pid < 4000 pid, and started.

#+BEGIN_SRC bash :exports results
  ps -aux | gawk '$1 ~ /clgc/ && $2 < 4000 { print $2 " " $9 }' | head -5
#+END_SRC

#+RESULTS:
| 1080 | Dec10 |
| 2167 | Dec08 |
| 2170 | Dec08 |
| 2175 | Dec08 |
| 2177 | Dec08 |

** Split on alternate

   #+begin_src bash :exports results
     echo "foo,bar,baz" | gawk -F, '{ print $2 }' 
   #+end_src

   #+RESULTS:
   : bar

* Remove NYT Registration Wall

  #+begin_src js
    document.getElementById("modal-portal-regiwall").remove(); document.getElementsByTagName("body")[0].classList = ""
  #+end_src

* RSync

** Checksum diff two directories

#+begin_src bash
rsync -rvnic --delete /source/ /destination/
#+end_src

Note that ~-n~ is the same as ~--dry-run~.

* ffmpeg

** Convert wav to mp3

From: https://stackoverflow.com/a/12952172/34450

#+begin_src bash
ffmpeg -i $input.wav -vn -ar 44100 -ac 2 -b:a 192k $output.mp3
#+end_src
